[
  {
    "id": "a1e97063-0782-497a-a821-9c6ffbb0d7e9",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a1e97063-0782-497a-a821-9c6ffbb0d7e9",
    "created_at": "Tue Feb 23 00:36:22 UTC 2021",
    "company": "WW",
    "company_url": null,
    "location": "New York",
    "title": "Fullstack Product Engineers (Mid - Senior Levels) Remote",
    "description": "<p>WW is looking for candidates to help change people’s lives. We are a global wellness technology company inspiring millions of people to adopt healthy habits for real life. We do this through engaging digital experiences, face-to-face workshops, and sustainable programs that encourage people to move more, shift their mindset, and eat healthier while enjoying the foods they love. By drawing on over five decades of experience and expertise in behavioral science, we build communities in order to deliver wellness for all.</p>\n<p><strong>Role Overview:</strong></p>\n<p>To help us achieve our goals, we are seeking a Senior Software Engineer to join our team. You will leverage your knowledge to develop new consumer-focused products using modern Engineering such as Agile development, Continuous Integration, and Deployment, Microservices, etc. As a Senior Software Engineer at WW, your code, designs, and decisions will be highly visible, and will directly impact and delight our users.</p>\n<p><strong>Key Responsibilities:</strong></p>\n<ul>\n<li>Program daily in Node.js, Express, React, GraphQL, MongoDB, PostgreSQL, and others</li>\n<li>Build out restful endpoints and lightweight aggregation layers</li>\n<li>Build out new features and iterate on existing features</li>\n<li>Design and implement low-latency, high-availability, and performance applications</li>\n<li>Help define architectures and design patterns</li>\n<li>Participate in code reviews</li>\n<li>Answer technical inquiries on codebase and product requirements</li>\n<li>Lead the way with writing programmatic unit and integration tests</li>\n<li>Work closely with tech leads, product managers, and design teams</li>\n<li>Full responsibility for developing, testing, and deploying using our ci/cd tools</li>\n</ul>\n<p><strong>Qualifications:</strong></p>\n<ul>\n<li>Real world web and service development experience</li>\n<li>Deep experience with content modeling</li>\n<li>Experience with modern frameworks such as React, Node.js, Express</li>\n<li>Experience with web services API integration (GraphQL, Rest, JSON, XML)</li>\n<li>Experience with responsive HTML &amp; CSS frameworks such as bootstrap</li>\n<li>Understanding of general user experience and UI design principles</li>\n<li>Ability to understand requirements and map to technical implementation</li>\n<li>Relational and/or NoSQL database experiences such as MySQL, Postgres, or Mongodb</li>\n<li>Solid foundation in data structures, algorithms, and software design</li>\n<li>Strong track record of shipping products</li>\n<li>Knowledge of streaming services like Kafka or Kinesis will be a huge plus</li>\n<li>Experience with Continuous Integration/Continuous Delivery (CI/CD). Github Actions will be a plus</li>\n<li>Proficient understanding of code versioning tools such as GIT, SVN, etc</li>\n<li>Experience with Docker and Amazon Web Services a plus</li>\n<li>Experience with open source Content Management Systems such as Drupal, WordPress, Keystone are all pluses</li>\n<li>Experience with Swagger/OAS documentation a huge plus</li>\n<li>Experience in mentoring and leading other Engineers</li>\n<li>Computer science degree or equivalent academic or professional background</li>\n</ul>\n<p><em>WW is an equal opportunity employer. WW does not discriminate on the basis of sex, race, color, creed, national origin, marital status, age, religion, sexual orientation, gender identity, gender expression, veteran status, or disability.</em></p>\n",
    "how_to_apply": "<p><a href=\"https://ww.wd1.myworkdayjobs.com/careers/job/New-York-Remote/Fullstack-Software-Engineer---Remote--Mid---Senior-Levels-_R210000001342?source=GitHub\">Apply Here</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBakNhIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--2f1688b9e20418697e1397703b0d796122dd7df4/WW%20Logo.png"
  },

  {
    "id": "a63feabb-6976-4f74-b788-44afa96aed06",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a63feabb-6976-4f74-b788-44afa96aed06",
    "created_at": "Wed Feb 17 20:07:40 UTC 2021",
    "company": "Quadio",
    "company_url": "https://quadio.com",
    "location": "New York",
    "title": "Senior Frontend Engineer",
    "description": "<p>Quadio, an exciting new ecosystem of IRL and digital businesses designed to champion college creativity, is looking to expand its tech team as it rapidly advances v2 of its mobile-first app toward release. Founded in 2019 by an EDM producer with a passion for innovation and artistic collaboration and a Cornell grad with stints in strategy and marketing at Twitter and BlizzardActivision, Quadio’s team has grown to 24 strong, with a renowned board of advisors and strong financial funding. With a culture of creativity, urgency, and candor, Quadio seeks a wicked-smart, super-energized engineer who loves the arts and the people who make them come to life, embraces intensity and challenge with enthusiasm, and finds transparency as refreshing as we do. Our in-house motto is, “LET’S GOOOO,” and if that kind of positivity appeals to you, read on.</p>\n<h2>Responsibilities</h2>\n<ul>\n<li>Implement the features and user experiences that power Quadio’s web and mobile applications</li>\n<li>Architect efficient and reusable front-end systems that drive complex applications</li>\n<li>Collaborate closely with our Design, Marketing, and Product teams to build an engaging user experience for our users</li>\n<li>Build products and experiences people love through intuitive design and clear user experiences</li>\n<li>Take your ideas from concept to reality</li>\n<li>Put automated testing, tracking, and monitoring in place to ensure our systems are always working as expected</li>\n</ul>\n<h2>Experience</h2>\n<ul>\n<li>A minimum of 5 years of experience developing applications using Javascript/Typescript, including advanced knowledge of concepts like asynchronous programming, closures, types, and ES2015+</li>\n<li>Expertise in React Native, with experience in build and release pipelines - specifically publishing applications across both Apple’s iStore and Google’s Play Store.</li>\n<li>Expertise in browser APIs and optimizing for frontend performance</li>\n<li>Experience working with RESTful APIs and/or GraphQL as well as client/server architectures</li>\n</ul>\n<h2>Additional (Standout Qualifications)</h2>\n<ul>\n<li>Experience with frontend state management frameworks such as Redux, MobX-state-tree, or Vuex</li>\n<li>Experience in bridging React Native components across Java/Kotlin and/or Swift</li>\n<li>Experience with frontend frameworks like React, AngularJS, Vue.js, or another equivalent framework</li>\n<li>Expertise in HTML &amp; CSS, with a knack for layout, specificity, cross-browser compatibility, and accessibility</li>\n<li>Experience with AWS APIs, such as DynamoDB, Lambda, or CDK</li>\n<li>Excited about the opportunities and challenges of working on projects touching all areas of our codebase and associated microservices</li>\n<li>Experience with containerization tools, such as Docker or Kubernetes</li>\n<li>BS/MS in Computer Science or an equivalent major</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:anthony@quadio.com\">anthony@quadio.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbWlaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--07552c41932649728393054d493fcd94b39f6a16/QuadioIcon.png"
  },
  {
    "id": "f4d51a91-b916-4438-b0fd-61106c188746",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f4d51a91-b916-4438-b0fd-61106c188746",
    "created_at": "Wed Feb 17 15:43:54 UTC 2021",
    "company": "ALDI Einkauf SE & Co. oHG Loading",
    "company_url": "https://www.aldi-nord.de",
    "location": "Essen",
    "title": "DevOps Engineer (m/w/d)",
    "description": "<h2>Das sind deine Aufgaben</h2>\n<ul>\n<li>Umsetzung von DevOps für eine Cloud-basierte Analytics Plattform</li>\n<li>Aufbau automatischer Tools zu Orchestrierung, Monitoring und Entstörung automatisierter Daten- und Analysestrecken</li>\n<li>Optimierung existierender Datenbeladungsprozessen und ggf. Überführung in einen modernen Zielzustand</li>\n<li>Einhaltung von datenbezogenen Prioritäten zur Sicherstellung optimaler Verfügbarkeit der verschiedenen Daten zur richtigen Zeit</li>\n<li>Überwachung der Auslastung der Plattformkomponenten und Ableitung geeigneter Maßnahmen zur Performanceproblemen</li>\n<li>Dokumentation und Wissensvermittlung zu den Datenstrecken und deren Orchestrierung</li>\n<li>Anbindung und Aufbau neuer Daten- und Analysestrecken durch Mitarbeit in cross-funktionalen, agilen Projektteams zur Realisierung von Use Cases</li>\n<li>Enge Zusammenarbeit mit Data Engineering, Modelling und Quality</li>\n</ul>\n<h2>Das bringst du mit</h2>\n<ul>\n<li>Erfolgreich abgeschlossenes Studium der Informatik oder eine vergleichbare Qualifikation mit technischem Schwerpunkt</li>\n<li>Mehrjährige Erfahrung mit dem Aufsetzen von Cloud-Umgebungen für und dem Einsatz von DevOps-Technologien für das Data Management oder Analytics Use Cases</li>\n<li>Fundierte Kenntnisse in den Bereichen ETL/ELT, SQL, Automatisierungstechnologien und Software Engineering Methodiken</li>\n<li>Ausgeprägte technische und analytische Fähigkeiten, hohe Methodenkompetenz</li>\n<li>Hohe Kommunikations- und Beratungsstärke</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<h2>Das bieten wir dir</h2>\n<ul>\n<li>Top-Branchengehalt</li>\n<li>Eine abwechslungsreiche und anspruchsvolle Tätigkeit</li>\n<li>Einen sicheren Arbeitsplatz bei der Nr. 1 im Discount</li>\n<li>Ein leistungsstarkes und angenehmes Arbeitsumfeld in einem Team, das sich auf dich freut!</li>\n</ul>\n<h2>Interessiert?</h2>\n<p><a href=\"https://vonq.io/3u5cQQU\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3u5cQQU\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbHlaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b13f7473328b5e589c1cadb46970722e607115b2/Aldi.png"
  },
  {
    "id": "fb73d8f4-6cf4-4559-9fc8-ce5e358bfafd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/fb73d8f4-6cf4-4559-9fc8-ce5e358bfafd",
    "created_at": "Thu Feb 11 18:15:21 UTC 2021",
    "company": "Consumer Priority Services",
    "company_url": null,
    "location": "Brooklyn, NY",
    "title": "Full Stack Developer",
    "description": "<p>Full Stack Developer needed for well established and growing consumer based technology service company.</p>\n<p>Projects focus on enhancing and maintaining company’s proprietary platforms, including customer management, sales generation and sales team administration systems.</p>\n<p>Role requires deep experience and strong expertise with SQL, C#, VB.NET and Fluent Interface.</p>\n<p>Must also possess core competencies with HTML, CSS, Ajax, JavaScript, jQuery, JSON, .NET as well as SaaS vehicles including WordPress, Shopify, BigCommerce, Magento and Epicor.</p>\n<p>The ideal candidate:</p>\n<p>· A creative problem solver with a business mindset.</p>\n<p>· An analytical thinker with strong communication skills</p>\n<p>· A results oriented demeanor</p>\n<p>· Extremely accessible due to the dynamic nature of our business.</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:mfein@cpscentral.com\">mfein@cpscentral.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdkdZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e6c1af228b81fb2fd01c6b28b93d9a12bc7944a8/CPS-Logo-high-res2.jpg"
  },
  {
    "id": "4038bd10-222a-4764-ba69-edff432c02e3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4038bd10-222a-4764-ba69-edff432c02e3",
    "created_at": "Wed Feb 03 16:32:42 UTC 2021",
    "company": "NYU Langone Health",
    "company_url": null,
    "location": "New York",
    "title": "Senior CRM Application Developer",
    "description": "<p>NYU Langone Health is a world-class, patient-centered, integrated academic medical center, known for its excellence in clinical care, research, and education. It comprises more than 200 locations throughout the New York area, including five inpatient locations, a children’s hospital, three emergency rooms and a level 1 trauma center. Also part of NYU Langone Health is the Laura and Isaac Perlmutter Cancer Center, a National Cancer Institute designated comprehensive cancer center, and NYU Grossman School of Medicine, which since 1841 has trained thousands of physicians and scientists who have helped to shape the course of medical history.\nWe have an exciting opportunity to join our team as a Senior CRM Application Developer.\nIn this role, the successful candidate reports to the Director of Fundraising Analytics and Data Services. This role works in a team environment to support NYU Langone Health’s Office of Development &amp; Alumni Affair’s existing and future application systems with a focus on Blackbaud CRM and Blackbaud’s Luminate product.\nThe Senior CRM Application Developer will be expected to participate in all facets of application development including the requirements gathering process, solution design, code and UI development quality assurance, and deployment.\nKey Responsibilites:</p>\n<ul>\n<li>Responsible for the successful delivery of new application features</li>\n<li>Integration between applications, integration with data vendors, and defect fixing of existing applications</li>\n<li>Produce data exports, reports and dashboards for various areas of the organization to analyze</li>\n<li>Maintain proficiency in the most current content and structural use of the Development Offices donor database system, Blackbaud CRM (TRAX)</li>\n<li>As technical lead, responsible for the successful development and delivery of new BBCRM application features such as data-lists, data forms, dashboards, APIs, widgets, smart fields, KPIs, and UI models</li>\n<li>Utilizing T-SQL to assist in the development of data reporting in order to perform complex queries and data mining. Create and maintain complex stored procedures as required</li>\n<li>Design and develop SQL Server stored procedures, functions and views to be used during the ETL Process using SSIS</li>\n<li>Responsible for building and maintaining integrations between BBCRM and other applications (Salesforce, Tableau, Luminate APIs) and integrations with data vendors</li>\n</ul>\n<p>Qualifications:</p>\n<ul>\n<li>A Bachelor’s Degree  (in Computer Science or similar, or commensurate experience if not related to degree)</li>\n<li>5-7+ years of relevant experience required including:</li>\n<li>Minimum 2 years of experience developing custom features for the Blackbaud CRM application Blackbauds Software Development Kit (SDK)</li>\n<li>At least 5 years of experience developing with an object-oriented language such as VB, .NET or C#, HML, CSS, XML</li>\n<li>Minimum 5 years of experience developing against MS SQL Server and full knowledge of T-SQL, SSIS and SSRS</li>\n<li>1 year of management experience preferred</li>\n<li>Experience with Blackbaud’s Luminate Online and Pagebuilder preferred</li>\n<li>Experience with Web development languages such as Drupal, JavaScript, and/or ASP. NET preferred</li>\n<li>Knowledge of non-profit healthcare philanthropy a plus</li>\n<li>Ability to work independently as well as in an interdepartmental team</li>\n<li>Time management skills with the ability to prioritize, meet deadlines, plan and manage multiple simultaneous projects and handle shifting priorities</li>\n<li>Disciplined and detail-oriented in a fast-paced environment</li>\n</ul>\n<p>NYU Langone Health provides its staff with far more than just a place to work. Rather, we are an institution you can be proud of, an institution where you’ll feel good about devoting your time and your talents.\nPlease apply online at <a href=\"https://jobs.nyulangone.org/job/11993888/senior-crm-application-developer-new-york-ny/\">https://jobs.nyulangone.org/job/11993888/senior-crm-application-developer-new-york-ny/</a>\nNYU Langone Health is an equal opportunity and affirmative action employer committed to diversity and inclusion in all aspects of recruiting and employment.</p>\n",
    "how_to_apply": "<p>Please apply online at <a href=\"https://jobs.nyulangone.org/job/11993888/senior-crm-application-developer-new-york-ny/\">https://jobs.nyulangone.org/job/11993888/senior-crm-application-developer-new-york-ny/</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ1NZIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3092ee5c0759ed6e5abd5381f863f7b9c406e42/NewLogoPurpleType.jpg"
  },
  {
    "id": "75998254-9128-4503-9377-1e169f2155b8",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/75998254-9128-4503-9377-1e169f2155b8",
    "created_at": "Mon Feb 01 14:20:42 UTC 2021",
    "company": "ALDI Einkauf GmbH & Co. oHG",
    "company_url": "https://vonq.io/39nrs5H",
    "location": "Essen",
    "title": "IT Projektmanager Campus (m/w/d)",
    "description": "<h2>Über uns</h2>\n<p>ALDI Nord zählt mit einer mehr als 100-jährigen Erfolgsgeschichte zu den führenden Lebensmitteleinzelhändlern in Europa. Als Erfinder des Discounts ist es unser Anspruch, das Einkaufen für unsere Kunden so einfach wie möglich zu machen. Dafür erfinden wir uns immer wieder neu, entwickeln uns weiter und gestalten so die Zukunft des Discounts. Du hast die POWER, gemeinsam mit uns zu wachsen? Werde Teil unseres Teams!</p>\n<h2>Das sind Deine Aufgaben</h2>\n<ul>\n<li>Eigenverantwortliche Leitung und Durchführung von IT-(Teil-)Projekten</li>\n<li>Erarbeitung und Abstimmung ausgereifter Lösungskonzepte mit den Entscheidern vor Ort und den zentralen Organisationseinheiten</li>\n<li>Verantwortung für die Erreichung der Projektziele (Budget, Qualität, Zeit) und Sicherstellung der Projektmanagement-Dokumentation</li>\n<li>Zentraler Ansprechpartner und Schnittstelle zwischen den IT-Abteilungen sowie den verschiedenen Fachbereichen</li>\n<li>Steuerung, Koordination und Monitoring externer Dienstleister</li>\n</ul>\n<h2>Das bringst Du mit</h2>\n<ul>\n<li>Abgeschlossenes Studium der (Wirtschafts-)Informatik oder eine vergleichbare Qualifikation</li>\n<li>Erfahrung in der Leitung und Steuerung von IT-Projekten und die Fähigkeit auch bei heterogenen Themen den Überblick zu behalten</li>\n<li>Sehr gute Kommunikations- und Präsentationsfähigkeiten sowie eine analytische und eigenständige Arbeitsweise</li>\n<li>Eine gut strukturierte und organisierte Arbeitsweise sowie eine hohe Auffassungsgabe, um sich schnell in neue Aufgabenfelder einzuarbeiten</li>\n<li>Kenntnisse im Bereich IT-Infrastruktur wünschenswert - insbesondere im Kontext Bauprojekte (Netzwerk, Medientechnik, Workplace, Printing, Telefonie, Zugangssysteme, CAFM etc.)</li>\n</ul>\n<h2>Das bieten wir Dir</h2>\n<ul>\n<li>Top-Branchengehalt</li>\n<li>Eine abwechslungsreiche und anspruchsvolle Tätigkeit</li>\n<li>Einen sicheren Arbeitsplatz bei der Nr. 1 im Discount</li>\n<li>Ein leistungsstarkes und angenehmes Arbeitsumfeld in einem Team, das sich auf dich freut!</li>\n</ul>\n<h2>Interessiert?</h2>\n<p>Wir freuen uns auf Ihre Bewerbung über das <strong>Bewerbungsformular</strong></p>\n<h2>Kontakt</h2>\n<p>ALDI Einkauf GmbH &amp; Co. oHG</p>\n<p>Eckenbergstr. 16</p>\n<p>45307 Essen</p>\n<p><a href=\"https://vonq.io/39nrs5H\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/39nrs5H\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbzZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f99a80b23d1a3d9c37f85517c6f071a9f7900c66/Aldi.jpg"
  }
]